Revit 2026 API

# ControlledApplicationRegisterFailuresProcessor Method

---

Registers Revit application-wide instance of Failures Processor.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void RegisterFailuresProcessor(
	IFailuresProcessor processor
)
```
```vb
Public Shared Sub RegisterFailuresProcessor (
	processor As IFailuresProcessor
)
```
```cpp
public:
static void RegisterFailuresProcessor(
	IFailuresProcessor^ processor
)
```
```fsharp
static member RegisterFailuresProcessor :
        processor : IFailuresProcessor -> unit
```

#### Parameters

processor IFailuresProcessor
     Instance of Failures Processor to be used by the Revit Application.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was NULL |

If there is previously registered Failures Processor, it gets discarded. If you opt to register a FailuresProcessor for Revit, your processor will become the default error handler for all Revit errors for the session. The standard Revit error dialog will not appear. If you want to handle only specific failures but not all types of failures in your application, subscribe to the FailuresProcessing event instead, or use FailuresPreprocessor interface for the specific transaction.

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace